The point location on curve.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public PointLocationOnCurve LocationOnCurve { get; }
  Visual Basic
Public ReadOnly Property LocationOnCurve As PointLocationOnCurve
	Get
  Visual C++
public:
property PointLocationOnCurve^ LocationOnCurve {
	PointLocationOnCurve^ get ();
}
 See Also
  PointOnEdge Class
  Autodesk.Revit.DB Namespace